{
  "category": "Playlist",
  "changelog": "Fixed json parsing - Running unit tests after a major upgrade turns out to be a good idea.\nUpdated to .net 8 and Jellyfin 10.9.0\nv2.* Changes have been made to the JSON schema, old files should still be read correctly, and when saved will use the new format.\nAdded a Jobs page to the dashboard, to allow an admin to see the status of the playlist generation, it will include errors if they failed.\nChanged TargetValue, to be one or many values. You can either have it a  single json value like a string, number or bool. Or an array of values. This allows a single Expression to match multiple values, rather then needing many single Expressions.\nAdded a MatchMode option, to allow selection of how sets of values are considered to be valid.\n  Modes are, Any, All, OnlyOne, AllButOne, None, Half, HalfOrMore, HalfOrLess.\n  Defualts \n   SmartPlaylist is Any, meaning as long as one ExpressionSet matches the item is included.\n   ExpressionSet is All, meaning all Expressions must match for the item to be included.\n   Expression is Any, meaning only one of the TargetValues must match for the item to be included.\nAdded config options to the Plugin config page.\n  Options include\n    PlaylistBatchedProcessing - Batch playlists by user and ItemKinds, allows processing of multiple playlits at once (may have performace impacts)\n    PlaylistDetailedErrors - Show the whole StackTrace of an error on the jobs details page.\n    AlwaysSaveFile - Always save the json file, when processing the playlist.\n    BackupFileOnSave - Backup files on save\n    PlaylistFolderName - Allow you to specify the folder within the Jellyfin Data folder to store playlists\n    PlaylistBackupFolderName - Allow you to specify the folder within the Jellyfin Data folder to store backups playlists\n    PlaylistSorterThreadCount - Set the thread count for how many Items are processed in parallel\n    ",
  "description": "Smart Playlist 2 Playlist Harder!.\nIs a system to automatically generate playlists based on a set of rules.\nBuilt off of the base of SmartPlaylist by ankenyr.\n",
  "guid": "5a63fe63-765f-43f7-a129-661e839f83d5",
  "imageUrl": "",
  "name": "SmartPlaylist2PlaylistHarder",
  "overview": "Smart Playlist 2 Playlist Harder! Is a system to automatically generate playlists based on a set of rules\nBuilt off of the base of SmartPlaylist by ankenyr",
  "owner": "JMiles42",
  "targetAbi": "10.9.0.0",
  "timestamp": "2024-05-16T10:03:03Z",
  "version": "2.1.1.0"
}